# This will make it easier to get started on a new machine.

brew 'eza'            # Easy to use alias manager, with icons
brew 'bat'            # Better cat, with syntax highlighting
brew 'fd'             # Better find
brew 'fzf'            # Fuzzy finder for terminal
brew 'zoxide'         # Easy navigation (better cd)
brew 'tlrc'         # A better man page viewer
brew 'thefuck'      # Command-line tool for correcting mistyped console commands
brew 'lazydocker'   # Terminal UI for Docker and Docker Compose
brew 'lazygit'      # Simple terminal UI for Git commands
brew 'rm-improved'  # Improved version of the 'rm' command with trash folder support
# brew 'bandwhich'    # Terminal bandwidth utilization tool
# brew 'ctop'         # Top-like interface for container metrics
# brew 'glances'      # System monitoring tool - a better htop
brew 'speedtest-cli' # Command-line interface for testing internet bandwidth using speedtest.net
brew 'nvm'          # Node Version Manager - Simple bash script to manage multiple active Node.js versions
brew 'micro'        # Better Nano replacement.
brew 'ripgrep'      # Faster grep replacement.
brew 'rsync'        # 
brew 'midnight-commander'   # File explorer for terminal
